In [1]:
import pandas as pd
import numpy as np

In [26]:
series = pd.Series(np.arange(15))
series

0      0
1      1
2      2
3      3
4      4
5      5
6      6
7      7
8      8
9      9
10    10
11    11
12    12
13    13
14    14
dtype: int32

In [28]:
series.size

15

In [27]:
data = {
    "Name": ['Vasea', 'Ciprian', 'Dima'],
    "Age": [10, 80, 31]
}

df = pd.DataFrame(data=data)
df

      Name  Age
0    Vasea   10
1  Ciprian   80
2     Dima   31

In [10]:
data_lists = [['Anea', 3], ['Lolik', 100]]
df2 = pd.DataFrame(data=data_lists, columns=['Person Name', 'Person age'])
df2

In [19]:
df2.index

RangeIndex(start=0, stop=2, step=1)

In [20]:
df2.values

array([['Anea', 3],
       ['Lolik', 100]], dtype=object)

In [21]:
df2.shape

(2, 2)

In [22]:
df2.columns

Index(['Person Name', 'Person age'], dtype='object')

In [24]:
df2.dtypes

Person Name    object
Person age      int64
dtype: object

In [25]:
df2.size

4

In [32]:
df2.head(n=1)

  Person Name  Person age
0        Anea           3

In [33]:
df2.tail(1)

  Person Name  Person age
1       Lolik         100

In [34]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 2 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Person Name  2 non-null      object
 1   Person age   2 non-null      int64
dtypes: int64(1), object(1)
memory usage: 164.0+ bytes

In [35]:
df2.describe()

       Person age
count    2.000000
mean    51.500000
std     68.589358
min      3.000000
25%     27.250000
50%     51.500000
75%     75.750000
max    100.000000

In [193]:
df3 = pd.read_csv('./marketing_campaign.csv').iloc[:5, :5]
df3

     ID  Year_Birth   Education Marital_Status   Income
0  5524        1957  Graduation         Single  58138.0
1  2174        1954  Graduation         Single  46344.0
2  4141        1965  Graduation       Together  71613.0
3  6182        1984  Graduation       Together  26646.0
4  5324        1981         PhD        Married  58293.0

In [194]:
df3.to_csv('./data.csv', index=False, sep=';')
df3 = pd.read_csv('./data.csv', sep=';')
df3

     ID  Year_Birth   Education Marital_Status   Income
0  5524        1957  Graduation         Single  58138.0
1  2174        1954  Graduation         Single  46344.0
2  4141        1965  Graduation       Together  71613.0
3  6182        1984  Graduation       Together  26646.0
4  5324        1981         PhD        Married  58293.0

In [195]:
df3.to_excel('./data.xlsx', index=False)
df3.to_json('./data.json', index=False, orient='records')

In [ ]:
import sqlite3

conn = '127.0.0.1:8000'
df3.to_sql('table_name', conn, if_exists='replace', index=False)

In [ ]:
sql_df = pd.read_sql('SELECT * FROM users', conn)

In [114]:
df3.iloc[0, 1] = None
df3

     ID  Year_Birth   Education Marital_Status   Income
1  2174         NaN  Graduation         Single  46344.0
2  4141      1965.0  Graduation       Together  71613.0
3  6182      1984.0  Graduation       Together  26646.0
4  5324      1981.0         PhD        Married  58293.0

In [104]:
df3.isnull()

      ID  Year_Birth  Education  Marital_Status  Income
0  False        True      False           False   False
1  False       False      False           False   False
2  False       False      False           False   False
3  False       False      False           False   False
4  False       False      False           False   False

In [105]:
df3.notnull()

     ID  Year_Birth  Education  Marital_Status  Income
0  True       False       True            True    True
1  True        True       True            True    True
2  True        True       True            True    True
3  True        True       True            True    True
4  True        True       True            True    True

In [107]:
df3.isnull().sum()

ID                0
Year_Birth        1
Education         0
Marital_Status    0
Income            0
dtype: int64

In [111]:
df3[df3.isnull()] = 0
df3

     ID  Year_Birth   Education Marital_Status   Income
0  5524         0.0  Graduation         Single  58138.0
1  2174      1954.0  Graduation         Single  46344.0
2  4141      1965.0  Graduation       Together  71613.0
3  6182      1984.0  Graduation       Together  26646.0
4  5324      1981.0         PhD        Married  58293.0

In [113]:
df3 = df3.dropna()
df3

     ID  Year_Birth   Education Marital_Status   Income
1  2174      1954.0  Graduation         Single  46344.0
2  4141      1965.0  Graduation       Together  71613.0
3  6182      1984.0  Graduation       Together  26646.0
4  5324      1981.0         PhD        Married  58293.0

In [121]:
df3.fillna('NANUL')

     ID Year_Birth   Education Marital_Status   Income
1  2174      NANUL  Graduation         Single  46344.0
2  4141     1965.0  Graduation       Together  71613.0
3  6182     1984.0  Graduation       Together  26646.0
4  5324     1981.0         PhD        Married  58293.0

In [118]:
df3.ffill()

     ID  Year_Birth   Education Marital_Status   Income
1  2174         NaN  Graduation         Single  46344.0
2  4141      1965.0  Graduation       Together  71613.0
3  6182      1984.0  Graduation       Together  26646.0
4  5324      1981.0         PhD        Married  58293.0

In [197]:
df3.bfill()

     ID  Year_Birth   Education Marital_Status   Income
0  5524        1957  Graduation         Single  58138.0
1  2174        1954  Graduation         Single  46344.0
2  4141        1965  Graduation       Together  71613.0
3  6182        1984  Graduation       Together  26646.0
4  5324        1981         PhD        Married  58293.0

In [198]:
df3.set_index(['ID', 'Year_Birth'], inplace=True)
df3

                  Education Marital_Status   Income
ID   Year_Birth
5524 1957        Graduation         Single  58138.0
2174 1954        Graduation         Single  46344.0
4141 1965        Graduation       Together  71613.0
6182 1984        Graduation       Together  26646.0
5324 1981               PhD        Married  58293.0

In [199]:
df3.reset_index(inplace=True)
df3

     ID  Year_Birth   Education Marital_Status   Income
0  5524        1957  Graduation         Single  58138.0
1  2174        1954  Graduation         Single  46344.0
2  4141        1965  Graduation       Together  71613.0
3  6182        1984  Graduation       Together  26646.0
4  5324        1981         PhD        Married  58293.0

In [200]:
df3.loc[:2, ['ID', 'Education']]

     ID   Education
0  5524  Graduation
1  2174  Graduation
2  4141  Graduation

In [201]:
df3[df3['Education']=='Graduation']

     ID  Year_Birth   Education Marital_Status   Income
0  5524        1957  Graduation         Single  58138.0
1  2174        1954  Graduation         Single  46344.0
2  4141        1965  Graduation       Together  71613.0
3  6182        1984  Graduation       Together  26646.0

In [202]:
df3.loc[df3['Marital_Status']=='Single']

     ID  Year_Birth   Education Marital_Status   Income
0  5524        1957  Graduation         Single  58138.0
1  2174        1954  Graduation         Single  46344.0

In [205]:
df3.loc[df3['Marital_Status']=='Single', 'Marital_Status'] = 'Inteligent'
df3

     ID  Year_Birth   Education Marital_Status   Income
0  5524        1957  Graduation     Inteligent  58138.0
1  2174        1954  Graduation     Inteligent  46344.0
2  4141        1965  Graduation       Together  71613.0
3  6182        1984  Graduation       Together  26646.0
4  5324        1981         PhD        Married  58293.0